[
    {
        "title": "Python",
        "category": "General Programming",
        "text": "Python is the programming language I have used the most, and will be my go-to for smaller research projects and quick turn-arounds.",
        "rating": 5,
        "url": "https://www.python.org/"
    },
    {
        "title": "Vue3",
        "category": "JS Frameworks",
        "text": "Vue3 is my preferred JS frontend framework (and what this website is written in). Almost all the web dev work I have done is using Vue3.",
        "rating": 5,
        "url": "https://vuejs.org/"
    },
    {
        "title": "Ansible",
        "category": "DevOps",
        "text": "I have used Ansible for standing up fairly simplistic VMs for dev environments. I really like Ansible but rarely have the need to write a playbook.",
        "rating": 2,
        "url": "https://www.ansible.com/"
    },
    {
        "title": "Docker",
        "category": "DevOps",
        "text": "I tend to Dockerize almost every app I write. I am very proficient with docker-compose as well, and using multiple containers across a network.",
        "rating": 5,
        "url": "https://www.docker.com/"
    },
    {
        "title": "Matlab",
        "category": "General Programming",
        "text": "I have used Matlab extensively in years past (and was a TA for an intro Matlab course) but since college I have not needed to use it.",
        "rating": 3,
        "url": "https://www.mathworks.com/products/matlab.html"
    },
    {
        "title": "Java",
        "category": "General Programming",
        "text": "Java was the first language I learned and I used to use it for backends with Spring and Thymeleaf. I haven't written any Java recently.",
        "rating": 3,
        "url": "https://www.java.com/en/"
    },
    {
        "title": "TypeScript",
        "category": "JS Frameworks",
        "text": "In my opinion, JavaScript is irrelevant in modern development so long as TypeScript exists. I prefer to only use TypeScript whenever possible.",
        "rating": 5,
        "url": "https://www.typescriptlang.org/"
    },
    {
        "title": "FastAPI",
        "category": "Python Libraries",
        "text": "I prefer FastAPI over Flask when standing up Python web backends. It is much more performant, and far more convenient when it comes to dependency injection.",
        "rating": 5,
        "url": "https://fastapi.tiangolo.com/"
    },
    {
        "title": "Flask",
        "category": "Python Libraries",
        "text": "While I have used Flask quite a bit, I prefer FastAPI. Flask requires so many 3rd party helper libraries that I am not familiar with all of them.",
        "rating": 3,
        "url": "https://flask.palletsprojects.com/en/2.2.x/"
    },
    {
        "title": "Rust",
        "category": "General Programming",
        "text": "Rust is a language I am actively learning. It's syntax and safety features are beautiful, and if Rust is the future I want to be a part of it.",
        "rating": 3,
        "url": "https://www.rust-lang.org/"
    },
    {
        "title": "React",
        "category": "JS Frameworks",
        "text": "I have used React quite a bit in the past, but abandoned it once I learned Vue. I much prefer Vue, but am flexible to the desires of any project.",
        "rating": 3,
        "url": "https://reactjs.org/"
    },
    {
        "title": "SQLAlchemy",
        "category": "Python Libraries",
        "text": "I have used SQLAlchemy (and Alembic) extensively in my projects. I am constantly learning with it, which is why I love it.",
        "rating": 4,
        "url": "https://www.sqlalchemy.org/"
    },
    {
        "title": "React Native",
        "category": "JS Frameworks",
        "text": "When I switched from Android to iOS and lost all my apps, I decided to learn React Native. I wish I had more time for it.",
        "rating": 2,
        "url": "https://reactnative.dev/"
    },
    {
        "title": "C#",
        "category": "General Programming",
        "text": "I actually prefer C# to Java, and wish I had the opportunity to do more .NET development in general because of it.",
        "rating": 3,
        "url": "https://learn.microsoft.com/en-us/dotnet/csharp/"
    },
    {
        "title": "C",
        "category": "General Programming",
        "text": "It's been a long time since I have seen a seg fault, but I came the closest to an all nighter in my life writing C.",
        "rating": 1,
        "url": "https://en.wikipedia.org/wiki/C_(programming_language)"
    },
    {
        "title": "Express",
        "category": "JS Frameworks",
        "text": "I have used Express for a few projects, but I prefer FastAPI for most development. I am comfortable with Express, but not an expert.",
        "rating": 3,
        "url": "https://expressjs.com/"
    },
    {
        "title": "Sequelize",
        "category": "JS Frameworks",
        "text": "I have used Sequelize with Express and it is my preferred ORM for NodeJS. I especially like the migration support and that they are adding more and more TypeScript support.",
        "rating": 3,
        "url": "https://sequelize.org/"
    },
    {
        "title": "AWS",
        "category": "Cloud Architecture",
        "text": "AWS is something I have used extensively in my current role. I have spun up services on ECS and EKS and am very comfortable with Cognito and Amplify.",
        "rating": 4,
        "url": "https://aws.amazon.com/"
    },
    {
        "title": "Kubernetes",
        "category": "Cloud Architecture",
        "text": "Kubernetes is something I had to learn for my current role. I am now quite familiar with Helm, and can navigate a cluster with kubectl efficiently.",
        "rating": 4,
        "url": "https://kubernetes.io/"
    },
    {
        "title": "PostgreSQL",
        "category": "Databases",
        "text": "Postgres is my preferred SQL database, mainly because of the helper functions it has that can be used with arrays. The JSON support can also be very useful. ",
        "rating": 4,
        "url": "https://www.postgresql.org/"
    },
    {
        "title": "MySQL/MariaDB",
        "category": "Databases",
        "text": "Honestly the only reason I have ever used MySQL or MariaDB was so I could use MySQL Workbench. I have found DBeaver also has similar ERD support for Postgres so I have mainly switched to that.",
        "rating": 3,
        "url": "https://www.mysql.com/"
    },
    {
        "title": "Elasticsearch",
        "category": "Databases",
        "text": "I have mainly used Elasticsearch when working with data scientists to add search capabilities for big data in backend systems.",
        "rating": 3,
        "url": "https://www.elastic.co/elasticsearch"
    },
    {
        "title": "MongoDB",
        "category": "Databases",
        "text": "Mongo is my preferred NoSQL database. I have used it for a few projects and have found it to be very easy to use and integrate with Python.",
        "rating": 4,
        "url": "https://www.mongodb.com/"
    },
    {
        "title": "d3.js",
        "category": "JS Frameworks",
        "text": "I have used d3.js to make several data visualizations, but I am not an expert. It is something I am currently expanding on in my role.",
        "rating": 3,
        "url": "https://d3js.org/"
    },
    {
        "title": "ROS",
        "category": "System Management",
        "text": "Much of the software I write in my current role runs in ROS or micro-ROS and leverages its DDS capabilities to handle communication between Docker containers.",
        "rating": 4,
        "url": "https://www.ros.org/"
    },
    {
        "title": "Unraid",
        "category": "System Management",
        "text": "I have used Unraid for my personal server for years (it's serving this website). I also run Home Assistant, Pi-hole and Plex, as well as many other things.",
        "rating": 4,
        "url": "https://unraid.net/"
    }
]
